# StairsRunWidthMeasurement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunWidthMeasurement Property
ParameterTypeId Class See Also
---
"Run Width Measurement": Run Width Measurement
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunWidthMeasurement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunWidthMeasurement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunWidthMeasurement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace